load-test/test-traffic-hitting-login-page.yml
config:
  target: "https://stage.identity.q4inc.com"
  ensure:
    max: 10000 # fail if max response time exceeds 5000ms
    maxErrorRate: 8 # fail if error rate exceeds 0%
  phases:
    - duration: 100 # 5 min
      arrivalRate: 4 # 4 users per second ~ 200 per minutecala: 4, 8, 12, 20
      rampTo: 6 #range of users per second
      name: "Q4 IDP Login Load Test 300-166->333-228179506-all"
scenarios:
  - name: "Perform Q4 IDP Login http journey to console"
    flow:
      - log: "Area: Traffic hittin login page"
      - get:
          url: "/oauth/auth?client_id=q4-platform-client&redirect_uri=https%3A%2F%2Fconnect.stage.q4inc.com%2F%3Flogin%3Dv2&response_type=code&scope=openid+profile+email&state=5906fe8a249b4381a2a545ba9a981997&code_challenge=eH7x82wi60yOtIEp0OUBJL24utoD8LkliiRbgC8hKuY&code_challenge_method=S256&resource=https%3A%2F%2Fconnect.stage.q4inc.com&audience=q4-platform-stage.api"